[{"name":"AccessibilityComponent","properties":[{"comment":"The set of supported accessibility actions.","complete":"var systemActions: AccessibilityComponent.SupportedActions","name":"systemActions","type":"AccessibilityComponent.SupportedActions"},{"comment":"A succinct label that identifies the entity, in a localized string key.","complete":"var label: LocalizedStringResource?","name":"label","type":"LocalizedStringResource"},{"comment":"A Boolean value indicating whether the receiver is an accessibility entity that an assistive application can access.","complete":"var isAccessibilityElement: Bool","name":"isAccessibilityElement","type":"Bool"},{"comment":"A localized string key that represents the current value of the entity.","complete":"var value: LocalizedStringResource?","name":"value","type":"LocalizedStringResource"},{"comment":"An array of custom actions supported by the entity, identified by their localized string key.","complete":"var customActions: [LocalizedStringResource]","name":"customActions","type":"[LocalizedStringResource]"},{"comment":"An array of custom content objects that deliver accessibility information.  Use the Custom Content API to leverage assistive technologies to deliver complex data sets to users in measured portions when they need it.","complete":"var customContent: [AccessibilityComponent.CustomContent]","name":"customContent","type":"[AccessibilityComponent.CustomContent]"}]},{"comment":"Allows an entity to change the resolution of the resources it uses according to its relevance to the user.","name":"AdaptiveResolutionComponent","properties":[{"complete":"var pixelsPerMeter: Float { get }","name":"pixelsPerMeter","type":"Float"}]},{"comment":"Configure ambient rendering of sounds from an entity.  Ambient audio sources emit each channel of an audio resource from an angle projected from the entity, without reverberation. Ambient audio sources take into account the relative orientation of the source and the listener. Position is not taken into account; the channels do not get louder as the user moves toward them.  The audio resource's front channels (e.g., mono, center) are projected into the entity's -Z direction, with the rear channels projected into +Z. The left channels are laid out in -X and the right channels are laid out in +X.  ```swift let entity = Entity() let resource = try AudioFileResource.load(named: \"MyAudioFile\") entity.ambientAudio = AmbientAudioComponent() entity.playAudio(resource) ```  The `AmbientAudioComponent` allows you to set the overall level of all sounds played from the entity with the `gain` property, in relative Decibels, in the range `-.infinity ... .zero` where `-infinity` is silent and `.zero` is nominal.  ```swift entity.ambientAudio?.gain = -10 ```  Ambient audio sources are well suited to play back multichannel content which captures the acoustics of its originating environment in the recording process (e.g., multichannel field recordings of outdoor environments).","name":"AmbientAudioComponent","properties":[{"comment":"The hash value.  Hash values are not guaranteed to be equal across different executions of your program. Do not save hash values to use during a future execution.  - Important: `hashValue` is deprecated as a `Hashable` requirement. To   conform to `Hashable`, implement the `hash(into:)` requirement instead.   The compiler provides an implementation for `hashValue` for you.","complete":"var hashValue: Int { get }","name":"hashValue","type":"Int"},{"comment":"The overall level for all sounds emitted from an entity. In relative Decibels, in the range  `-.infinity ... .zero` where `.zero` is the default.","complete":"var gain: Audio.Decibel","name":"gain","type":"Audio.Decibel"}]},{"comment":"A description of how virtual content can be anchored to the real world.","name":"AnchoringComponent","properties":[{"comment":"The kind of real world object to which the anchor entity should anchor.","complete":"let target: AnchoringComponent.Target","name":"target","type":"AnchoringComponent.Target"},{"complete":"var trackingMode: AnchoringComponent.TrackingMode { get set }","name":"trackingMode","type":"AnchoringComponent.TrackingMode"}]},{"name":"AudioMixGroupsComponent","properties":[{"comment":"The hash value.  Hash values are not guaranteed to be equal across different executions of your program. Do not save hash values to use during a future execution.  - Important: `hashValue` is deprecated as a `Hashable` requirement. To   conform to `Hashable`, implement the `hash(into:)` requirement instead.   The compiler provides an implementation for `hashValue` for you.","complete":"var hashValue: Int { get }","name":"hashValue","type":"Int"}]},{"comment":"Configure channel-based rendering of sounds from an entity.  Channel audio sources route the audio resource's channels directly to the device's output without any spatialization or reverberation applied. Neither the position nor orientation of the entity is taken into consideration for channel rendering. For example, the left channel will always be heard from the left, and the right channel will always be heard from the right, regardless of where the user is oriented.  The channels of multichannel audio resources are panned according to their channel layout, including rear channels.  ```swift let entity = Entity() let resource = try AudioFileResource.load(named: \"MyAudioFile\") entity.channelAudio = ChannelAudioComponent() entity.playAudio(resource) ```  The `ChannelAudioComponent` allows you to set the overall level of all sounds played from the entity with the `gain` property, in relative Decibels, in the range `-.infinity ... .zero` where `-infinity` is silent and `.zero` is nominal.  ```swift entity.channelAudio?.gain = -10 ```  Channel audio sources are well suited to play back sounds not associated with any visual elements in a scene.","name":"ChannelAudioComponent","properties":[{"comment":"The overall level for all sounds emitted from an entity. In relative Decibels, in the range  `-.infinity ... .zero` where `.zero` is the default.","complete":"var gain: Audio.Decibel","name":"gain","type":"Audio.Decibel"},{"comment":"The hash value.  Hash values are not guaranteed to be equal across different executions of your program. Do not save hash values to use during a future execution.  - Important: `hashValue` is deprecated as a `Hashable` requirement. To   conform to `Hashable`, implement the `hash(into:)` requirement instead.   The compiler provides an implementation for `hashValue` for you.","complete":"var hashValue: Int { get }","name":"hashValue","type":"Int"}]},{"comment":"A component that manages character movement.  To use a character controller, add a ``CharacterControllerComponent`` and a ``CharacterControllerStateComponent`` to your entity to make it a character entity. Character entities can *move* to new locations in space, which happens over a period of time based on how you've configured the character controller component, and also *teleport*, which moves the charcter to the new location instantaneously.  - Note: PhysicsBodyComponent and CollisionComponent can not exist on the same Entity that contains         a CharacterControllerComponent and are therefore inactivated.","name":"CharacterControllerComponent","properties":[{"comment":"The capsule radius.  Specify this value in the entity's coordinate system.","complete":"var radius: Float","name":"radius","type":"Float"},{"comment":"Y axis direction relative to the physics origin.  Rotates the object so that the vertical height is along the up vector. Vector must be normalized and specified in *physics space*, the coordinate system of the physics simulation.","complete":"var upVector: SIMD3<Float>","name":"upVector","type":"SIMD3<Float>"},{"comment":"The maximum obstacle height that the controller can move over.  Specify this value relative to the entity's coordinate system.  Changing this value after the CharacterControllerComponent has been created and added to Entity has no effect.","complete":"var stepLimit: Float","name":"stepLimit","type":"Float"},{"comment":"The slope limit expressed as a limit angle in radians.  This value represents the maximum slope that the character can move over. RealityKit applies this value to characters that are walking on static objects, but not when walking on kinematic or dynamic objects.  Changing this value after the CharacterControllerComponent has been created and added to Entity has no effect.","complete":"var slopeLimit: Float","name":"slopeLimit","type":"Float"},{"comment":"The capsule height.  The capsule height includes radii and should be specified the entity's coordinate system.","complete":"var height: Float","name":"height","type":"Float"},{"comment":"An added tolerance around the character capsule.  A small skin, known as the *contact offset*, is maintained around the controller's volume to avoid rounding and precision issues with collision detection. Specify this value relative to the entity's coordinate system.","complete":"var skinWidth: Float","name":"skinWidth","type":"Float"},{"comment":"The character's collision filter.  For more information on using collision filters, see <doc:\/\/com.apple.documentation\/realitykit\/controlling-entity-collisions-in-realitykit\/>.","complete":"var collisionFilter: CollisionFilter","name":"collisionFilter","type":"CollisionFilter"}]},{"comment":"An object that maintains state for a character controller.  Add this component to an entity, this along with ``CharacterControllerComponent``, to use the entity as a character that moves and animates.","name":"CharacterControllerStateComponent","properties":[{"comment":"True if character controller is grounded, otherwise false.","complete":"let isOnGround: Bool","name":"isOnGround","type":"Bool"},{"comment":"The linear speed relative to the phyics origin. In physics space.","complete":"let velocity: SIMD3<Float>","name":"velocity","type":"SIMD3<Float>"}]},{"comment":"A component that gives an entity the ability to collide with other entities that also have collision components.  This component holds the entity's data related to participating in the scene's physics simulation. It is also used to calculate collision queries, raycasts, and convex shape casts. Entities can participate in the scene simulation in two different modes: as a *rigid body* or as a *trigger*.  A rigid body fully participates in the collision simulation. It affects the velocity and direction of entities it collides. If configured with a rigid body ``RealityKit\/PhysicsBodyComponent\/mode`` of ``RealityKit\/PhysicsBodyMode\/dynamic``, it's own velocity and direction can be affected by other rigid body entities. A trigger entity doesn't have any impact on the rigid bodies in the scene, but can trigger code or Reality Composer behaviors when a rigid body enity overlaps it.  Note the following when considering applying a non-uniform scale to an entity: - Non-uniform scaling is applicable only to box, convex mesh and triangle mesh collision shapes. - Non-uniform scaling is not supported for all other types of collision shapes. In this case the scale.x value is duplicated to the scale's y and z components as well to force scale uniformity based on the x component. - If the entity has a non-uniform scale assigned to its transform then that entity should not have any descendants assigned that contain rotations in their transforms. A good rule of thumb is to assign the non-uniform scale to the entity that has the collision shape, and avoid adding children below that entity.  Turn an entity into a trigger by adding a ``RealityKit\/CollisionComponent`` to it and setting its ``RealityKit\/CollisionComponent\/mode-swift.property`` to ``RealityKit\/CollisionComponent\/Mode-swift.enum\/trigger``.  Turn an entity into a _rigd body_ by adding a  ``RealityKit\/PhysicsBodyComponent`` to the entity in addition to a ``RealityKit\/CollisionComponent``.  The ``PhysicsBodyComponent`` defines the physical properties of the entity, such as its mass and collision shape.  The `filter` property defines the entity's collision filter, which determines which other objects the entity collides with. For more information, see <doc:controlling-entity-collisions-in-realitykit>.  - Note: If an entity has a ``RealityKit\/PhysicsBodyComponent``, the  collision component's mode is ignored. An entity can be a rigid body, or a trigger, but not both at the same time.","name":"CollisionComponent","properties":[{"comment":"The collision filter used to segregate entities into different collision groups.","complete":"var filter: CollisionFilter","name":"filter","type":"CollisionFilter"},{"comment":"The collision mode.","complete":"var mode: CollisionComponent.Mode","name":"mode","type":"CollisionComponent.Mode"},{"comment":"A collection of shape resources that collectively represent the outer dimensions of an entity for the purposes of collision detection.","complete":"var shapes: [ShapeResource]","name":"shapes","type":"[ShapeResource]"},{"comment":"A Boolean value that indicates whether the collider is static.  When an object is static the physics engine recognizes that the object isn't moving, which typically improves performance.","complete":"var isStatic: Bool { get set }","name":"isStatic","type":"Bool"},{"complete":"var collisionOptions: CollisionComponent.CollisionOptions { get set }","name":"collisionOptions","type":"CollisionComponent.CollisionOptions"}]},{"name":"GroundingShadowComponent","properties":[{"comment":"If true, the entity will cast a shadow","complete":"var castsShadow: Bool","name":"castsShadow","type":"Bool"}]},{"comment":"A component that applies a standard highlight effect when someone focuses an entity.   - Note: A `CollisionComponent` is required for the ``Entity`` to be part of hit-testing.","name":"HoverEffectComponent","properties":[]},{"name":"ImageBasedLightComponent","properties":[{"comment":"The intensity value of the probe An intensityExponent of 0 means using the diffuse\/specular intensities as-is Otherwise the intensity is multiplied by 2^intensityExponent","complete":"var intensityExponent: Float","name":"intensityExponent","type":"Float"},{"comment":"Whether the IBL inherit the rotation of the Entity","complete":"var inheritsRotation: Bool","name":"inheritsRotation","type":"Bool"},{"comment":"Image(s) of the lighting environment","complete":"var source: ImageBasedLightComponent.Source","name":"source","type":"ImageBasedLightComponent.Source"}]},{"name":"ImageBasedLightReceiverComponent","properties":[{"complete":"var imageBasedLight: Entity","name":"imageBasedLight","type":"Entity"}]},{"comment":"A component that gives an entity the ability to receive system input.  This component should be added to an entity to inform the system that it should be treated as a target for input handling. It can be customized to require only specific forms of input like direct or indirect interactions. By default the component is configured to handle all forms of input on the system.  The hit testing shape that defines the entity's interactive entity is defined by the `CollisionComponent`. To configure an entity for input but avoid any sort of physics-related processing, add an `InputTargetComponent` and `CollisionComponent`, but disable the `CollisionComponent` for collision detection, for example:  ``` \/\/ Enable the entity for input. myEntity.components.set(InputTargetComponent())  \/\/ Create a collision component with an empty group and mask. var collision = CollisionComponent(shapes: [.generateSphere(radius: 0.1)]) collision.filter = CollisionFilter(group: [], mask: []) myEntity.components.set(collision) ```  `InputTargetComponent` behaves hierarchically, so if it is added to an entity that has descendants with `CollisionComponent`s, those shapes will be used for input handling. The `isEnabled` flag can be used to override this behavior by adding the `InputTargetComponent` to a descendant and setting `isEnabled` to false.  `InputTargetComponent`'s `allowedInputTypes` property allows the entity to only receive the provided types of input. This property also propagates down the hierarchy, but if a descendant also has an `InputTargetComponent` defined, its `allowedInputTypes` property overrides the value provided by the ancestor.","name":"InputTargetComponent","properties":[{"comment":"The set of input types this component's entity can receive.","complete":"var allowedInputTypes: InputTargetComponent.InputType","name":"allowedInputTypes","type":"InputTargetComponent.InputType"},{"comment":"Whether the component's entity is enabled for input.","complete":"var isEnabled: Bool","name":"isEnabled","type":"Bool"}]},{"comment":"A collection of resources that create the visual appearance of an entity.","name":"ModelComponent","properties":[{"comment":"The materials used by the model.  Each ``RealityKit\/MeshResource`` requires a set of materials. An entity that has no materials renders using a pink, striped material.  To determine the number of  materials a model entity requires , use `MeshResource.expectedMaterialCount`","complete":"var materials: [Material]","name":"materials","type":"[Material]"},{"comment":"A margin applied to an entity’s bounding box that determines object visibility.  When determining which entities are currently visible, RealityKit tests each entity’s bounding box to see if it overlaps with the camera’s field of view (also known as the camera’s _frustum_). For efficiency, entities with a bounding box that don’t overlap the camera’s frustum aren’t rendered. Use this property to prevent RealityKit from incorrectly culling entities that use a ``CustomMaterial`` with a geometry modifier that moves vertices outside of the entity’s bounding box.  RealityKit adds the value of `boundsMargin` to the bounding box before determining which entities are visible.","complete":"var boundsMargin: Float { get set }","name":"boundsMargin","type":"Float"},{"comment":"The mesh that defines the shape of the entity.  For more information, see ``RealityKit\/MeshResource``","complete":"var mesh: MeshResource","name":"mesh","type":"MeshResource"}]},{"comment":"A component that changes how RealityKit renders its entity to help with debugging.  Attaching a `ModelDebugOptionsComponent` to a ``ModelEntity`` tells RealityKit to change the way it renders that entity based on a specified ``ModelDebugOptionsComponent\/visualizationMode-swift.property``. This component isolates individual parts of the rendering process, such as the entity’s transparency or roughness, and displays surface color to help identify visual anomalies.  To use this component, create a `ModelDebugOptionsComponent` and set its ``ModelDebugOptionsComponent\/visualizationMode-swift.property`` to the desired value. Then, set the component as the entity’s ``ModelEntity\/modelDebugOptions`` property:  ```swift if let robot = anchor.findEntity(named: \"Robot\") as? ModelEntity {     let component = ModelDebugOptionsComponent(visualizationMode: .normal)     robot.modelDebugOptions = component } ```  For more information on the visualization modes supported by `ModelDebugOptionsComponent`, see ``ModelDebugOptionsComponent\/VisualizationMode-swift.enum``.  ## Attach a Debug Component to an Entity  To attach a debug component to a particular entity, traverse the entity tree while passing the component to each child:  ```swift \/\/ Traverse the entity tree to attach a certain debug mode through components. func attachDebug(entity: Entity, debug: ModelDebugOptionsComponent) {     entity.components.set(debug)     for child in entity.children {         attachDebug(entity: child, debug: debug)     } } \/\/ Respond to a button or UI element. func debugLightingDiffuseButtonCallback() {     let debugComponent = ModelDebugOptionsComponent(visualizationMode: .lightingDiffuse)     attachDebug(entity: model, debug: debugComponent) } ```  ## Attach a Debug Component to a Trait  To attach a debug component based on a trait, traverse the entity tree while checking for ``HasModel`` adoption:  ```swift func attachDebug(entity: Entity, debug: ModelDebugOptionsComponent) {     if let model = entity as? ModelEntity {         model.visualizationMode = debug     }     for child in entity.children {         attachDebug(entity: child, debug: debug)     } } \/\/ Respond to a button or UI element. func debugLightingDiffuseButtonCallback() {     let debugComponent = ModelDebugOptionsComponent(visualizationMode: .lightingDiffuse)     attachDebug(entity: model, debug: debugComponent) } ```","name":"ModelDebugOptionsComponent","properties":[{"comment":"The part of the rendering process to display as the entity’s surface texture.","complete":"var visualizationMode: ModelDebugOptionsComponent.VisualizationMode { get }","name":"visualizationMode","type":"ModelDebugOptionsComponent.VisualizationMode"}]},{"comment":"A component that allows an entity's models to be rendered in an explicit order relative to the models of other entities in the same sort group. If this component is on an entity, then it must belong to a sort group.","name":"ModelSortGroupComponent","properties":[{"comment":"Group membership is strictly defined by having an identical group to other entities in the scene. This is not hierarchical; membership only applies to the entity which owns this component.","complete":"var group: ModelSortGroup { get set }","name":"group","type":"ModelSortGroup"},{"comment":"The draw order of the model relative to other models in its group. Lower value means the model draws earlier.","complete":"var order: Int32 { get set }","name":"order","type":"Int32"}]},{"name":"OpacityComponent","properties":[{"comment":"The opacity value applied to the entity and its descendants.","complete":"var opacity: Float","name":"opacity","type":"Float"}]},{"name":"ParticleEmitterComponent","properties":[{"comment":"Attributes affecting secondary particles spawned from the main simulation.","complete":"var spawnedEmitter: ParticleEmitterComponent.ParticleEmitter? { get set }","name":"spawnedEmitter","type":"ParticleEmitterComponent.ParticleEmitter"},{"comment":"Defines a plus\/minus range from which a value is randomly selected to offset Spawn Spread Factor.","complete":"var spawnSpreadFactorVariation: Float","name":"spawnSpreadFactorVariation","type":"Float"},{"comment":"Whether or not the spawnedEmitter's color should be overriden by the mainEmitter's color at the time of the spawning.","complete":"var spawnInheritsParentColor: Bool","name":"spawnInheritsParentColor","type":"Bool"},{"comment":"Controls particle simulation state: playing, paused or stopped. Defaults to `play`.","complete":"var simulationState: ParticleEmitterComponent.SimulationState","name":"simulationState","type":"ParticleEmitterComponent.SimulationState"},{"comment":"The initial speed, in meters per second, for newly spawned particles. Defaults to 0.5.","complete":"var speed: Float","name":"speed","type":"Float"},{"comment":"Number of particles to emit in a single burst. Defaults to 100.","complete":"var burstCount: Int","name":"burstCount","type":"Int"},{"comment":"The emitter shape size in meters.","complete":"var emitterShapeSize: SIMD3<Float>","name":"emitterShapeSize","type":"SIMD3<Float>"},{"comment":"Determines if the entity's transformation also affects the particles.","complete":"var particlesInheritTransform: Bool","name":"particlesInheritTransform","type":"Bool"},{"comment":"Determines when main particles emit spawn particles. Defaults to `onDeath`.","complete":"var spawnOccasion: ParticleEmitterComponent.SpawnOccasion","name":"spawnOccasion","type":"ParticleEmitterComponent.SpawnOccasion"},{"comment":"How much of the parent particle's velocity to inherit. Defaults to 1.","complete":"var spawnVelocityFactor: Float","name":"spawnVelocityFactor","type":"Float"},{"comment":"Radius of the torus' emitter shape tube. Defaults to 0.25.","complete":"var torusInnerRadius: Float","name":"torusInnerRadius","type":"Float"},{"comment":"The direction particles are emitted when birthDirection is set to World or Local. Defaults to (0.0, 1.0, 0.0).","complete":"var emissionDirection: SIMD3<Float>","name":"emissionDirection","type":"SIMD3<Float>"},{"comment":"The possible locations for newly spawned particles, relative to the emitter shape. Defaults to surface.","complete":"var birthLocation: ParticleEmitterComponent.BirthLocation","name":"birthLocation","type":"ParticleEmitterComponent.BirthLocation"},{"comment":"The shape of the region of space where the system spawns new particles. Defaults to plane.","complete":"var emitterShape: ParticleEmitterComponent.EmitterShape","name":"emitterShape","type":"ParticleEmitterComponent.EmitterShape"},{"comment":"Defines a plus\/minus range from which a value is randomly selected to offset `burstCount`.","complete":"var burstCountVariation: Int","name":"burstCountVariation","type":"Int"},{"comment":"Defines a plus\/minus range (in meters per second) from which a value is randomly selected to offset particle speed.","complete":"var speedVariation: Float","name":"speedVariation","type":"Float"},{"comment":"The possible initial directions for newly spawned particles, relative to the emitter shape.Defaults to normal.","complete":"var birthDirection: ParticleEmitterComponent.BirthDirection","name":"birthDirection","type":"ParticleEmitterComponent.BirthDirection"},{"comment":"Radial sweep angle for sphere, cylinder, cone, and torus emitter shapes. Defaults to 2 * pi.","complete":"var radialAmount: Float","name":"radialAmount","type":"Float"},{"comment":"Disables\/enables particle emission, independent of `simulationState`. Existing particles will not be affected.","complete":"var isEmitting: Bool","name":"isEmitting","type":"Bool"},{"comment":"Field Simulation Space, either local or global","complete":"var fieldSimulationSpace: ParticleEmitterComponent.SimulationSpace","name":"fieldSimulationSpace","type":"ParticleEmitterComponent.SimulationSpace"},{"comment":"Particle attributes affecting the main particles of the base simulation.","complete":"var mainEmitter: ParticleEmitterComponent.ParticleEmitter","name":"mainEmitter","type":"ParticleEmitterComponent.ParticleEmitter"},{"comment":"Amount a spawned particle spreads away from its parent particle, works in conjunction with the spawn particle's `spreadingAngle`. Defaults to 0.","complete":"var spawnSpreadFactor: Float","name":"spawnSpreadFactor","type":"Float"}]},{"comment":" In AR applications, the camera is automatically provided by the system. In non-AR scenarios, the camera needs to be set by the app. (If no camera is provided by the app, the system will use default camera.)","name":"PerspectiveCameraComponent","properties":[{"comment":"The minimum distance in meters from the camera that the camera can see.  The value defaults to 1 centimeter. Always use a value greater than `0` and less than the value of ``PerspectiveCameraComponent\/far``. The renderer clips any surface closer than the ``PerspectiveCameraComponent\/near`` point.","complete":"var near: Float","name":"near","type":"Float"},{"comment":"The maximum distance in meters from the camera that the camera can see.  The value defaults to infinity. Always use a value greater than the value of ``PerspectiveCameraComponent\/near``. The renderer clips any surface beyond the ``PerspectiveCameraComponent\/far`` point.","complete":"var far: Float","name":"far","type":"Float"},{"comment":"The camera’s total vertical field of view in degrees.  This property contains the entire vertifical field of view for the camera in degrees. The system automatically calculates the horizontal field of view from this value to fit the aspect ratio of the device’s screen.  This property defaults to `60` degrees.","complete":"var fieldOfViewInDegrees: Float","name":"fieldOfViewInDegrees","type":"Float"}]},{"comment":"A component that defines an entity’s behavior in physics body simulations.  To participate in a scene's physics simulation, an entity must have a ``RealityKit\/PhysicsBodyComponent`` and a ``RealityKit\/CollisionComponent``. If you need to move an entity that participates in the physics system, it also needs a ``RealityKit\/PhysicsMotionComponent``.  Add a physics body component to an entity by adopting the ``HasPhysicsBody`` protocol, which allows RealityKit’s physics simulation to compute behavior in response to forces acting upon the body, following basic rules of Newtonian mechanics.  Note the following when considering applying a non-uniform scale to an entity: - Non-uniform scaling is applicable only to box, convex mesh and triangle mesh collision shapes. - Non-uniform scaling is not supported for all other types of collision shapes. In this case the scale.x value is duplicated to the scale's y and z components as well to force scale uniformity based on the x component. - If the entity has a non-uniform scale assigned to its transform then that entity should not have any descendants assigned that contain rotations in their transforms. A good rule of thumb is to assign the non-uniform scale to the entity that has the collision shape, and avoid adding children below that entity.  - Note: Model entities have a physics body component by default.","name":"PhysicsBodyComponent","properties":[{"comment":"A tuple of Boolean values that you use to lock the position of the physics body along any of the three axes.  You can restrict movement of the body along one or more axes by setting the corresponding item in the tuple to `true`. For example, if you set the `x` and the `z` items in the tuple to `true`, then the body can move only along the y-axis. By default, movement isn’t restricted.","complete":"var isTranslationLocked: (x: Bool, y: Bool, z: Bool)","name":"isTranslationLocked","type":"(x: Bool, y: Bool, z: Bool)"},{"comment":"A Boolean that controls whether the physics simulation performs continuous collision detection.  Set the value to `true` to perform continuous collision detection. The value is `false` by default, indicating the simulation should apply discrete collision detection.  Discrete collision detection considers only the position of a body once per rendered frame, or about every 16 milliseconds at 60 frames per second. Continuous collision detection considers the position of the body throughout the frame interval. The latter is more computationally expensive, but can help to avoid missing a collision for a quickly moving object, like a projectile.","complete":"var isContinuousCollisionDetectionEnabled: Bool","name":"isContinuousCollisionDetectionEnabled","type":"Bool"},{"comment":"The physics body’s mass properties, like inertia and center of mass.  By default, the mass properties value is ``PhysicsMassProperties\/default``, which matches the properties of a unit sphere with mass of 1 kilogram.","complete":"var massProperties: PhysicsMassProperties","name":"massProperties","type":"PhysicsMassProperties"},{"comment":"A Boolean value that indicates whether gravity acts on dynamic rigid bodies.","complete":"var isAffectedByGravity: Bool { get set }","name":"isAffectedByGravity","type":"Bool"},{"comment":"The physics body’s material properties, like friction.  By default, the body’s material resource is set to ``PhysicsMaterialResource\/default``, which provides a modest amount of friction and restitution (bounciness).","complete":"var material: PhysicsMaterialResource","name":"material","type":"PhysicsMaterialResource"},{"comment":"The value that controls how fast a dynamic rigid body's translation motion approaches the zero rest state.  - Important: The damping value must be non-negative.","complete":"var linearDamping: Float { get set }","name":"linearDamping","type":"Float"},{"comment":"A tuple of Boolean values that you use to lock rotation of the physics body around any of the three axes.  For any one of the three Booleans in the tuple that you set to `true`, rotation is restricted on the axis represented by that item. For example, if you set the `x` item to true, then the body can’t rotate around the x-axis. By default, rotation isn’t restricted.","complete":"var isRotationLocked: (x: Bool, y: Bool, z: Bool)","name":"isRotationLocked","type":"(x: Bool, y: Bool, z: Bool)"},{"comment":"The value that controls how fast a dynamic rigid body's rotational motion approaches the zero rest state.  - Important: The damping value must be non-negative.","complete":"var angularDamping: Float { get set }","name":"angularDamping","type":"Float"},{"comment":"The physics body’s mode, indicating how or if it moves.  By default, this value is set to ``PhysicsBodyMode\/dynamic``, meaning the body responds to forces.","complete":"var mode: PhysicsBodyMode","name":"mode","type":"PhysicsBodyMode"}]},{"comment":"A component that controls the motion of the body in physics simulations.  You specify velocities in the coordinate space of the physics simulation defined by ``ARView\/PhysicsSimulationComponent.nearestSimulationEntity``.  The behavior of an entity with a physics motion component depends on the entity’s ``PhysicsBodyComponent\/mode`` setting:  - term ``PhysicsBodyMode\/static``: The physics simulation ignores the velocities. The entity doesn’t move. - term ``PhysicsBodyMode\/kinematic``: The physics simulation moves the body according to the values you set for ``PhysicsMotionComponent\/angularVelocity`` and ``PhysicsMotionComponent\/linearVelocity``. - term ``PhysicsBodyMode\/dynamic``: The physics simulation overwrites the velocity values based on simulation, and ignores any values that you write.","name":"PhysicsMotionComponent","properties":[{"comment":"The linear velocity of the body in the physics simulation.","complete":"var linearVelocity: SIMD3<Float>","name":"linearVelocity","type":"SIMD3<Float>"},{"comment":"The angular velocity of the body around the center of mass.","complete":"var angularVelocity: SIMD3<Float>","name":"angularVelocity","type":"SIMD3<Float>"}]},{"comment":"A component that controls localized physics simulations.  To use a localized physics simulation add a ``PhysicsSimulationComponent`` to the desired root entity. Use the component to set custom physics simulation properties such as ``gravity`` and ``collisionOptions`` specific to the physics simulation.","name":"PhysicsSimulationComponent","properties":[{"comment":"The gravity for the simulation relative to the simulation entity.  The value stored in this property is the gravitational acceleration applied to dynamic physics body entities every frame along the negative world Y axis. The default value is `-9.81` meters per second squared.","complete":"var gravity: SIMD3<Float>","name":"gravity","type":"SIMD3<Float>"},{"comment":"A custom clock which drives the physics simulation, defaults to the engine clock.","complete":"var clock: CMClockOrTimebase { get set }","name":"clock","type":"CMClockOrTimebase"},{"comment":"Options for kinematic collision reporting.","complete":"var collisionOptions: PhysicsSimulationComponent.CollisionOptions","name":"collisionOptions","type":"PhysicsSimulationComponent.CollisionOptions"}]},{"name":"PortalComponent","properties":[{"comment":"The target entity representing the world that the portal is targeting. When the target entity is valid and has a WorldComponent, the portal will render in its contents the target entity and its entity tree.","complete":"var targetEntity: Entity? { get set }","name":"targetEntity","type":"Entity"},{"comment":"The clipping plane of the portal, defined in the entity's local coordinates.  If defined, the portal will clip meshes inside the world, which are in front of the clipping plane.","complete":"var clippingPlane: PortalComponent.ClippingPlane?","name":"clippingPlane","type":"PortalComponent.ClippingPlane"}]},{"comment":"A component that maps features of the physical environment.  Example features include faces and the shape of arbitrary regions.","name":"SceneUnderstandingComponent","properties":[{"comment":"The type of real-world object that the component models.","complete":"var entityType: SceneUnderstandingComponent.EntityType?","name":"entityType","type":"SceneUnderstandingComponent.EntityType"},{"comment":"The origin which the component is created from","complete":"var origin: SceneUnderstandingComponent.Origin { get }","name":"origin","type":"SceneUnderstandingComponent.Origin"}]},{"comment":"Configure how sounds are emitted from an entity into the user's environment.  The position and orientation of spatial audio sources are updated continuously and automatically by the audio system, so sounds always come from an entity wherever it goes and wherever it is pointing. Spatial audio sources have the user environment's acoustics applied to them so that they blend in naturally with it, and they are distance attenuated so they become quieter the further away they are from the user.  - Note: Spatial audio sources emit only a single channel (i.e., mono). If the format of the audio resource played on the entity is stereo or multichannel, all of its channels will be mixed down to a single channel before spatialization. To minimize any unwanted mixdown artifacts, use mono source material where possible.  RealityKit audio playback is spatial by default, so no additional configuration is necessary to opt into sophisticated spatial rendering.  ```swift let entity = Entity() let resource = try AudioFileResource.load(named: \"MyAudioFile\") entity.playAudio(resource) \/\/ Audio file is played spatially from entity ```  The `SpatialAudioComponent` allows you to further customize the playback characteristics of spatial audio sources. The `gain`, `directLevel`, and `reverbLevel` properties are in relative Decibels, in the range `-.infinity ... .zero`, where `-.infinity` is silent and `.zero` is nominal.  For example, you can adjust the overall level of all sounds played from the entity with the `gain` property.  ```swift entity.spatialAudio = SpatialAudioComponent(gain: -10) ```  You can reduce the amount of reverb applied to all sounds played from the entity with the `reverbLevel` property. Reducing this value will make the sounds less reverberant and more intimate. Setting `reverbLevel` to `-.infinity` will cause the sounds to collapse into the head of the listener.  ```swift entity.spatialAudio?.reverbLevel = -6 ```  The `gain`, `directLevel`, and `reverbLevel` properties can be updated dynamically, for example based on your app's state, or in the context of a Custom RealityKit System.  The `directivity` property allows you to configure the radiation pattern for sound emitted from the entity.  ```swift entity.spatialAudio?.directivity = .beam(focus: 0.5) ```  Spatial audio sources project sounds along their -Z axis. If a spatial audio source is co-located and co-oriented with visual content authored with a +Z-forward coordinate convention, you will want to rotate your spatial audio source 180º about the Y-axis.  ```swift let parent = Entity()  \/\/ Add model entity let model = try ModelEntity.load(named: \"PositiveZForward\") parent.addChild(model)  \/\/ Add audio source entity let audioSource = Entity() parent.addChild(audioSource)  \/\/ Orient audio source towards +Z audioSource.orientation = .init(angle: .pi, axis: [0, 1, 0]) ```  This is only a consideration if you have explicitly set a `directivity` other than the default `.beam(focus: .zero)`, which projects sound evenly for all frequencies in all directions.","name":"SpatialAudioComponent","properties":[{"comment":"The level of the direct, unreverberated, signal emitted from an entity. In relative Decibels, in the range `-.infinity ... .zero` where `.zero` is the default.","complete":"var directLevel: Audio.Decibel","name":"directLevel","type":"Audio.Decibel"},{"comment":"The level of reverberated signal emitted from an entity. In relative Decibels, in the range  `-.infinity ... .zero`, where `.zero` is the default.  Reducing this value will cause the sound to be more intimate. Reducing this value to `.-infinity` will cause the sounds to collapse into the head of the listener.","complete":"var reverbLevel: Audio.Decibel","name":"reverbLevel","type":"Audio.Decibel"},{"comment":"The overall level for all sounds emitted from an entity. In relative Decibels, in the range  `-.infinity ... .zero` where `.zero` is the default.","complete":"var gain: Audio.Decibel","name":"gain","type":"Audio.Decibel"},{"comment":"The radiation pattern for sound emitted from an entity.  - Note: The `directivity` property cannot be updated dynamically, so you must set it before preparing or playing an         audio resource on an entity.","complete":"var directivity: Audio.Directivity","name":"directivity","type":"Audio.Directivity"},{"comment":"The hash value.  Hash values are not guaranteed to be equal across different executions of your program. Do not save hash values to use during a future execution.  - Important: `hashValue` is deprecated as a `Hashable` requirement. To   conform to `Hashable`, implement the `hash(into:)` requirement instead.   The compiler provides an implementation for `hashValue` for you.","complete":"var hashValue: Int { get }","name":"hashValue","type":"Int"}]},{"comment":"A component that synchronizes an entity between processes and networked applications.  An entity acquires a ``SynchronizationComponent`` instance by adopting the ``HasSynchronization`` protocol. All entities have this component because the ``Entity`` base class adopts the protocol.","name":"SynchronizationComponent","properties":[{"comment":"A Boolean that indicates whether the calling process owns the entity.","complete":"var isOwner: Bool { get }","name":"isOwner","type":"Bool"},{"comment":"The entity’s transfer ownership mode.  By default, the transfer mode is ``SynchronizationComponent\/OwnershipTransferMode-swift.enum\/autoAccept``. You can set it to ``SynchronizationComponent\/OwnershipTransferMode-swift.enum\/manual`` to require explicit confirmation of the request by your app.","complete":"var ownershipTransferMode: SynchronizationComponent.OwnershipTransferMode","name":"ownershipTransferMode","type":"SynchronizationComponent.OwnershipTransferMode"},{"comment":"A unique identifier of an entity within a network session.","complete":"var identifier: UInt64 { get }","name":"identifier","type":"UInt64"}]},{"name":"TextComponent","properties":[{"complete":"var backgroundColor: CGColor?","name":"backgroundColor","type":"CGColor"},{"complete":"var text: AttributedString?","name":"text","type":"AttributedString"},{"complete":"var cornerRadius: Float","name":"cornerRadius","type":"Float"},{"complete":"var size: CGSize { get set }","name":"size","type":"CGSize"}]},{"comment":"A component that defines the scale, rotation, and translation of an entity.  An entity acquires a ``Transform`` component, as well as a set of methods for manipulating the transform, by adopting the ``HasTransform`` protocol. This is true for all entities, because the ``Entity`` base class adopts the protocol.","name":"Transform","properties":[{"comment":"The scaling factor applied to the entity.","complete":"var scale: SIMD3<Float>","name":"scale","type":"SIMD3<Float>"},{"comment":"The rotation of the entity specified as a unit quaternion.","complete":"var rotation: simd_quatf","name":"rotation","type":"simd_quatf"},{"comment":"The position of the entity along the x, y, and z axes.","complete":"var translation: SIMD3<Float>","name":"translation","type":"SIMD3<Float>"},{"comment":"The hash value.  Hash values are not guaranteed to be equal across different executions of your program. Do not save hash values to use during a future execution.  - Important: `hashValue` is deprecated as a `Hashable` requirement. To   conform to `Hashable`, implement the `hash(into:)` requirement instead.   The compiler provides an implementation for `hashValue` for you.","complete":"var hashValue: Int { get }","name":"hashValue","type":"Int"},{"comment":"The transform represented as a 4x4 matrix.  The ``Transform`` component can’t represent all transforms that a general 4x4 matrix can represent. Using a 4x4 matrix to set the transform is therefore a lossy event that might result in certain transformations, like shear, being dropped.","complete":"var matrix: float4x4 { get set }","name":"matrix","type":"float4x4"}]},{"name":"VideoPlayerComponent","properties":[{"comment":"the current screen video dimension","complete":"var currentScreenVideoDimension: SIMD2<Float> { get }","name":"currentScreenVideoDimension","type":"SIMD2<Float>"},{"comment":"The current screen video dimension","complete":"var screenVideoDimension: SIMD2<Float> { get }","name":"screenVideoDimension","type":"SIMD2<Float>"},{"complete":"var desiredViewingMode: VideoPlaybackController.ViewingMode","name":"desiredViewingMode","type":"VideoPlaybackController.ViewingMode"},{"comment":"Returns the avPlayer passed in to init(avPlayer: AVPlayer)","complete":"var avPlayer: AVPlayer? { get }","name":"avPlayer","type":"AVPlayer"},{"complete":"var isPassthroughTintingEnabled: Bool","name":"isPassthroughTintingEnabled","type":"Bool"},{"comment":"Represents the current video player screen entity size(Width and Height) in meters if defer transition to app, this will always return 1x1","complete":"var playerScreenSize: SIMD2<Float> { get }","name":"playerScreenSize","type":"SIMD2<Float>"},{"complete":"var viewingMode: VideoPlaybackController.ViewingMode? { get }","name":"viewingMode","type":"VideoPlaybackController.ViewingMode"}]},{"comment":"When set on an entity, a WorldComponent separates the entity and its subtree to be rendered as part of a diferent world, that is only visible through a portal.  Entities in a WorldComponent are rendered in a isolated lighting environment. To light entities in this environment, use an ImageBasedLightComponent placed within the entity subtree.","name":"WorldComponent","properties":[]}]